In [3]:
import pandas as pd
import numpy as np

In [6]:
mar_bir = pd.read_csv('dataset_sample/data.csv')

In [9]:
mar_bir.shape

(500, 123)

In [11]:
mar_bir.head()

,id,sq1,sq2,sq3,q1_1,q1_2_1,q1_2_2,q1_3,q1_4,q1_5,...,sq4,sq5,sq6,sq6_a,sq7,sq8,sq9,sq10,sq11,sq12
0,1,1,9,27,1,2018,10,3,2,2,...,4,2,5,,5,6,2,3,5,5
1,2,1,9,44,1,2005,2,3,2,2,...,6,2,4,,4,6,1,5,5,3
2,3,2,9,39,1,2004,10,3,2,2,...,5,2,3,,4,5,1,4,6,3
3,4,2,9,44,1,2005,5,3,2,2,...,6,2,3,,4,4,1,4,6,4
4,5,2,9,40,1,2010,5,3,2,2,...,5,2,-1,,-1,-1,1,1,5,4

In [13]:
mar_bir.groupby('sq1').size()

sq1
1    250
2    250
dtype: int64

In [15]:
mar_bir['sq1'] = mar_bir['sq1'].replace(1, '남성')
mar_bir['sq1'] = mar_bir['sq1'].replace(2, '여성')

In [16]:
mar_bir.groupby('sq4').size()
#4:고졸 / 5:2년재 / 6:4년재

sq4
2      1
4     96
5    149
6    237
7     16
8      1
dtype: int64

In [17]:
mar_bir['sq4']= mar_bir['sq4'].replace(2, np.nan)
mar_bir['sq4']= mar_bir['sq4'].replace(4, "고졸")
mar_bir['sq4']= mar_bir['sq4'].replace(5, "2년제졸")
mar_bir['sq4']= mar_bir['sq4'].replace(6, "4년제졸")
mar_bir['sq4']= mar_bir['sq4'].replace(7, np.nan)
mar_bir['sq4']= mar_bir['sq4'].replace(8, np.nan)
#범주 리코딩

In [19]:
#교차분석 : 범주형으로 측정된 두 변수의 빈도(성별*학력)
pd.crosstab(mar_bir['sq4'], mar_bir['sq1'], margins = True)

sq1    남성   여성  All
sq4
2년제졸   68   81  149
4년제졸  119  118  237
고졸     55   41   96
All   242  240  482

In [22]:
mar_bir.groupby('q1_6').size()
#결혼에 대한 만족도 빈도 분석 / 매우 불만족 ~ 메우 만족

q1_6
1      4
2      9
3    134
4    274
5     79
dtype: int64

In [24]:
mar_bir.groupby('q1_13_3').size()
#자녀는 부부 관계를 더 굳건하게 해준다 / 전혀 아니다 ~ 매우 그렇다

q1_13_3
1     22
2     72
3    126
4    178
5    102
dtype: int64

# T-test : 두 집단의 평균 비교

In [25]:
print(mar_bir.groupby('sq1')['q1_6'].mean())
#남녀별 결혼만족도 평균

sq1
남성    3.916
여성    3.744
Name: q1_6, dtype: float64

In [26]:
male = mar_bir[mar_bir['sq1'] == '남성']
print('남성결혼만족 : ', male.q1_6.mean())

남성격혼만족 :  3.916

In [27]:
female = mar_bir[mar_bir['sq1'] == '여성']
print('여성결혼만족 : ', female.q1_6.mean())

여성결혼만족 :  3.744

In [29]:
import scipy.stats as stats

stats.ttest_ind(male.q1_6, female.q1_6, equal_var = True)

Ttest_indResult(statistic=2.6270170637123993, pvalue=0.008879184469354508)

In [31]:
print(mar_bir.groupby('sq1')['q1_13_3'].mean())

sq1
남성    3.656
여성    3.408
Name: q1_13_3, dtype: float64

In [32]:
# 남성/여성의 자녀인식 평균
print(mar_bir.groupby('sq1')['q1_13_3'].mean()) # 1 전혀아니다 ~ 5 매우 그렇다

sq1
남성    3.656
여성    3.408
Name: q1_13_3, dtype: float64

In [33]:
# 남성/여성의 자녀인식 평균
print(mar_bir.groupby('sq1')['q1_13_3'].mean()) # 1 전혀아니다 ~ 5 매우 그렇다

sq1
남성    3.656
여성    3.408
Name: q1_13_3, dtype: float64

In [36]:
male = mar_bir[mar_bir['sq1'] == '남성'] 
print('남성자녀인식: ', male.q1_13_3.mean())

남성자녀인식:  3.656

In [38]:
female = mar_bir[mar_bir['sq1'] == '여성'] 
print('여성자녀인식: ', female.q1_13_3.mean())

여성자녀인식:  3.408

In [40]:
# 두 집단의 평균에 차이가 있는지 없는지 t-test 수행
import scipy.stats as stats
stats.ttest_ind(male.q1_13_3, female.q1_13_3,
equal_var= True) # 분산이 동일한가 검정
# pvalue=0.011. 0.05보다 작다. 두 집단의 자녀인식에는 차이가 있다.

Ttest_indResult(statistic=2.532835306862453, pvalue=0.011620332201662524)

# ANOVA : 세 집단의 평균 비교

In [41]:
print(mar_bir.groupby('sq4')['q1_6'].mean())

sq4
2년제졸    3.724832
4년제졸    3.983122
고졸      3.604167
Name: q1_6, dtype: float64

In [44]:
HS = mar_bir[mar_bir['sq4'] == '고졸']
print(HS.q1_6.mean())

3.6041666666666665

In [45]:
univ2 = mar_bir[mar_bir['sq4'] == '2년제졸']
print(univ2.q1_6.mean())

3.7248322147651005

In [47]:
univ4 = mar_bir[mar_bir['sq4'] == '4년제졸'] 
print(univ4.q1_6.mean())

3.9831223628691985

In [49]:
# 고졸 2년제 4년제 & 자녀인식 평균
F_statistic, pVal = stats.f_oneway(HS.q1_6, univ2.q1_6, univ4.q1_6)
print(F_statistic, pVal)
# p<0.05 이므로 세 집단의 결혼만족도에는 차이가 있다.

12.042764344487303 7.891115151996855e-06

In [50]:
#학력에 따른 자녀출산인식
print(mar_bir.groupby('sq4')['q1_13_3'].mean())

sq4
2년제졸    3.536913
4년제졸    3.502110
고졸      3.625000
Name: q1_13_3, dtype: float64

In [51]:
HS = mar_bir[mar_bir['sq4'] == '고졸'] 
print(HS.q1_13_3.mean())

3.625

In [52]:
univ4 = mar_bir[mar_bir['sq4'] == '4년제졸']
print(univ4.q1_13_3.mean())

3.50210970464135

In [54]:
# 고졸 2년제 4년제 & 자녀인식 평균
F_statistic, pVal = stats.f_oneway(HS.q1_13_3, univ2.q1_13_3, univ4.q1_13_3) 
print(F_statistic, pVal)
# p>0.05 이므로 세 집단의 자녀인식에는 차이가 없다.

0.425509628064136 0.653683439217962